blog/2015-12-19-centos-mongo-install.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Sunday, December  4, 2022 at  5:26 PM -->
<meta charset="utf-8" />
<title>Mongo installed and confiure</title>
<meta name="author" content="Kinhung Lam" />
<meta name="generator" content="Org Mode" />
<meta name="twitter:site" content="@twylo" />
<meta name="twitter:creator" content="@twylo" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="me" href="https://weibo.com/u/2150445074" />
<link rel="icon" type="image/png" href="/images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="/images/icon/apple-touch-icon.png" />
<link rel="alternate" type="application/rss+xml" title="Weblog RSS Feed" href="/blog/rss.xml" />
<link rel="stylesheet" type="text/css" href="/res/faces.css">
<link rel="stylesheet" type="text/css" href="/res/style.css">
</head>
<body>
<div id="preamble" class="status">
<a class="skip-nav-link" href="#content">
  Skip navigation
</a>
<nav>
  <div class="navitem"><a href="/">Home</a></div>
  <div class="navitem"><a href="/blog/">Weblog</a></div>
  <div class="navitem"><a href="/portfolio/">Portfolio</a></div>
  <div class="navitem"><a href="/resume.html">Resume</a></div>
  <div class="navitem"><a href="/contact.html">Contact</a></div>
</nav>
<div class="published">
Published Saturday, December 19, 2015 at  9:54 PM
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Mongo installed and confiure</h1>
</header><p>
<b>1. 创建 /etc/yum.repos.d/mongodb-org-3.0.repo</b>
</p>

<pre class="example" id="org5627cbb">
[mongodb-org-3.0]
name=MongoDB Repository
baseurl=https://repo.mongodb.org/yum/redhat/$releasever/mongodb-org/3.0/x86_64/
gpgcheck=0
enabled=1
</pre>

<p>
<b>2. yum安装mongo</b>
</p>

<pre class="example">
=sudo yum install -y mongodb-org=
</pre>

<p>
或者 指定版本
</p>

<pre class="example">
=sudo yum install -y mongodb-org-3.0.7 mongodb-org-server-3.0.7 mongodb-org-shell-3.0.7 mongodb-org-mongos-3.0.7 mongodb-org-tools-3.0.7=
</pre>

<p>
为了阻止以后更新，你可能需要修改/etc/yum.conf文件，添加配置：
</p>

<pre class="example">
=exclude=mongodb-org,mongodb-org-server,mongodb-org-shell,mongodb-org-mongos,mongodb-org-tools=
</pre>


<p>
<b>3. dissable SELinux 防火樯</b>
</p>

<p>
<code>vi /etc/selinux/config</code>
</p>

<p>
修改：=SELINUX=disabled=
</p>

<p>
<b>4. 配置mongod.conf</b>
</p>

<p>
默认文件是=/etc/mongod.conf=
</p>

<p>
复制一份，修改配置中的 data，log 等属性
注意：要把=bind_ip=注释掉，不然只支持本地连接、不过生产环境建议开启，可能会安全一些，或者配置相应的地址，当然还可以修改端口，起用认证，毕竟数据安全很重要
</p>

<p>
<b>5. 设置开机启动</b>
</p>

<pre class="example" id="org5298d97">
sudo service mongod start
sudo chkconfig mongod on
sudo service mongod stop // 停止
sudo service mongod restart // 重启
</pre>

<p>
<b>6. 卸载</b>
</p>

<pre class="example" id="org7732043">
sudo yum erase $(rpm -qa | grep mongodb-org)
sudo rm -r /var/log/mongodb
sudo rm -r /var/lib/mongo
</pre>

<p>
<b>7. Mongo 迁移</b>
</p>

<ul class="org-ul">
<li><p>
导出：
</p>
<pre class="example">
=mongoexport --port 27017 --db zhibird --collection Subject_M --out ./Subject_M.json=
</pre></li>
<li><p>
导入：
</p>
<pre class="example">
=mongoimport --port 27017 --db zhibird --collection Subject_M --file ./Subject_M.json=
</pre></li>

<li>当然也可以使用 <code>mongodump</code> 和 <code>mongorestore</code> 命令进行导入导出</li>
</ul>

<p>
<b>8. ReplSet Config (复制集配置)</b>
</p>

<ul class="org-ul">
<li>分别修改所有实例的=mongod.conf=配置文件，增加=replSetName=rs0=</li>

<li>然后分别使用=mongod -f mongod.conf=命令启动 mongo</li>

<li><p>
或者直接启动，例如，首先创建三个不同的实例位置 ，分别启动，再统一配置
</p>
<pre class="example">
=mkdir -p /srv/mongodb/rs0-0 /srv/mongodb/rs0-1 /srv/mongodb/rs0-2=
=mongod --port 27017 --dbpath /srv/mongodb/rs0-0 --replSet rs0 --smallfiles --oplogSize 128 (端口默认为27017)=
</pre></li>
<li>连接其中一台mongo，使用=mongo &#x2013;port port=</li>

<li><p>
在=mongo shell=中：
</p>

<pre class="example" id="org4a52c63">
rsconf = {
         _id: "rs0",
         members: [
                    {
                     _id: 0,
                     host: "&lt;hostname&gt;:port"
                    }
                  ]
       }
</pre></li>

<li>使用=rs.initiate( rsconf )=初始化replSet配置</li>

<li>使用=rs.add("&lt;hostname&gt;:port1")=
=rs.add("&lt;hostname&gt;:port2")=添加其他两台信息</li>
</ul>

<p>
<b>备注：</b>
</p>

<pre class="example" id="orgd6210f0">
rs.initiate()
rs.conf()
rs.reconfig()
rs.add()         
rs.status()
</pre>

<p>
<b>9. mongo-connector（同步mongo数据到ES的工具）</b>
</p>

<p>
其中=config.json= 在 <code>mongo-connector</code>
的配置下，修改=namespace=配置（默认配置亦可）；
在终端下执行如下命令，即可启用数据复制，开始从mongo数据导出到ES中：
</p>

<pre class="example" id="org644d0b9">
nohup mongo-connector -c config.json --auto-commit-interval=20 -m localhost:27017 -d elastic_doc_manager -t localhost:9200 &amp;   
</pre>

<p>
<b>10. mongo shell 执行脚本</b>
</p>

<ul class="org-ul">
<li>直接shell下执行js文件，使用=mongo 127.0.0.1:27017/zhibird random.js=</li>

<li><p>
也可以使用=–eval=参数
<code>mongo 127.0.0.1:3003/test –eval “db.test.find().forEach(printjson);”</code>
</p>

<p>
=–eval=参数后面直接跟一个js语句
</p></li>
</ul>
</div>
<div id="postamble" class="status">
<div id="footer">
Proudly <a href="https://kinhung.me/blog/0110_emacs_blogging_for_fun_and_profit.html">published</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>. This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a> License. <a href="https://kinhung.me/privacy.html">Privacy Policy</a></div>
</div>
</body>
</html>
